Backend/loadtest/k6/results/redis/guest/report-2026-07-30-000415.txt
     ✓ status is 201
     ✓ response has docId

     checks.........................: 100.00% ✓ 3500      ✗ 0   
     data_received..................: 669 kB  9.4 kB/s
     data_sent......................: 191 kB  2.7 kB/s
     http_req_blocked...............: avg=48.75µs  min=0s      med=0s      max=8.67ms  p(90)=0s       p(95)=0s      
     http_req_connecting............: avg=33.67µs  min=0s      med=0s      max=2.01ms  p(90)=0s       p(95)=0s      
     http_req_duration..............: avg=42.69ms  min=35.09ms med=42.49ms max=61.99ms p(90)=46.35ms  p(95)=48.01ms 
       { expected_response:true }...: avg=42.69ms  min=35.09ms med=42.49ms max=61.99ms p(90)=46.35ms  p(95)=48.01ms 
     http_req_failed................: 0.00%   ✓ 0         ✗ 1750
     http_req_receiving.............: avg=159.91µs min=0s      med=0s      max=1.58ms  p(90)=622.56µs p(95)=692.29µs
     http_req_sending...............: avg=18.5µs   min=0s      med=0s      max=843.2µs p(90)=0s       p(95)=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s      med=0s      max=0s      p(90)=0s       p(95)=0s      
     http_req_waiting...............: avg=42.52ms  min=34.33ms med=42.33ms max=61.11ms p(90)=46.12ms  p(95)=47.82ms 
     http_reqs......................: 1750    24.639434/s
     iteration_duration.............: avg=1.04s    min=1.03s   med=1.04s   max=1.06s   p(90)=1.04s    p(95)=1.04s   
     iterations.....................: 1750    24.639434/s
     vus............................: 1       min=1       max=50
     vus_max........................: 50      min=50      max=50